In [1]:
# @title
%load_ext sql

In [2]:
# @title
import csv, sqlite3

con = sqlite3.connect("kingcounty.db")
cur = con.cursor()

In [3]:
# @title
!pip install -q pandas==1.1.5

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5.2/5.2 MB 15.1 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
  Building wheel for pandas (pyproject.toml) ... done
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
lida 0.0.10 requires fastapi, which is not installed.
lida 0.0.10 requires kaleido, which is not installed.
lida 0.0.10 requires python-multipart, which is not installed.
lida 0.0.10 requires uvicorn, which is not installed.
arviz 0.15.1 requires pandas>=1.3.0, but you have pandas 1.1.5 which is incompatible.
bigframes 0.19.2 requires pandas<2.1.4,>=1.5.0, but you have pandas 1.1.5 which is incompatible.
bokeh 3.3.4 requires pandas>=1.2, but you have pandas 1.1.5 which is incompatible.
google-colab 1.0.0 requires pandas==1.5.3, but you have pandas 1.1.5 which is incompatible.
ibis-framework 7.1.0 requires pandas<3,>=1.2.5, but you have pandas 1.1.5 which is incompatible.
mizani 0.9.3 requires pandas>=1.3.5, but you have pandas 1.1.5 which is incompatible.
panel 1.3.8 requires pandas>=1.2, but you have pandas 1.1.5 which is incompatible.
plotnine 0.12.4 requires pandas>=1.5.0, but you have pandas 1.1.5 which is incompatible.
seaborn 0.13.1 requires pandas>=1.2, but you have pandas 1.1.5 which is incompatible.
xarray 2023.7.0 requires pandas>=1.4, but you have pandas 1.1.5 which is incompatible.
yfinance 0.2.36 requires pandas>=1.3.0, but you have pandas 1.1.5 which is incompatible.

In [4]:
# @title
%sql sqlite:///kingcounty.db

In [11]:
# @title
import pandas as pd

In [14]:
# @title
df = pd.read_csv("kc_house_data.csv")
df.to_sql("kc_TBL", con, if_exists='replace', index=False)

21613

# Problems

1. Show the first few rows of the dataset

In [15]:
# @title
%sql SELECT * FROM kc_TBL LIMIT 5;

 * sqlite:///kingcounty.db
Done.

[(0, 7129300520, '20141013T000000', 221900.0, 3.0, 1.0, 1180, 5650, 1.0, 0, 0, 3, 7, 1180, 0, 1955, 0, 98178, 47.5112, -122.257, 1340, 5650),
 (1, 6414100192, '20141209T000000', 538000.0, 3.0, 2.25, 2570, 7242, 2.0, 0, 0, 3, 7, 2170, 400, 1951, 1991, 98125, 47.721, -122.319, 1690, 7639),
 (2, 5631500400, '20150225T000000', 180000.0, 2.0, 1.0, 770, 10000, 1.0, 0, 0, 3, 6, 770, 0, 1933, 0, 98028, 47.7379, -122.233, 2720, 8062),
 (3, 2487200875, '20141209T000000', 604000.0, 4.0, 3.0, 1960, 5000, 1.0, 0, 0, 5, 7, 1050, 910, 1965, 0, 98136, 47.5208, -122.393, 1360, 5000),
 (4, 1954400510, '20150218T000000', 510000.0, 3.0, 2.0, 1680, 8080, 1.0, 0, 0, 3, 8, 1680, 0, 1987, 0, 98074, 47.6168, -122.045, 1800, 7503)]

2. Display basic statistics for numerical columns

In [16]:
# @title
%sql SELECT  AVG(price) AS average_price,\
    MIN(price) AS min_price,\
    MAX(price) AS max_price,\
    COUNT(price) AS total_records\
FROM kc_TBL;

 * sqlite:///kingcounty.db
Done.

[(540088.1417665294, 75000.0, 7700000.0, 21613)]

3. Find the most common number of bedrooms:

In [18]:
# @title
%sql SELECT bedrooms, COUNT(bedrooms) AS count\
FROM kc_TBL\
GROUP BY bedrooms\
ORDER BY count DESC;

 * sqlite:///kingcounty.db
Done.

[(3.0, 9824),
 (4.0, 6882),
 (2.0, 2760),
 (5.0, 1601),
 (6.0, 272),
 (1.0, 199),
 (7.0, 38),
 (8.0, 13),
 (9.0, 6),
 (10.0, 3),
 (33.0, 1),
 (11.0, 1),
 (None, 0)]

4. Explore the relationship between the number of floors and average price:

In [19]:
# @title
%sql SELECT floors, AVG(price) AS average_price\
FROM kc_TBL\
GROUP BY floors\
ORDER BY floors;

 * sqlite:///kingcounty.db
Done.

[(1.0, 442180.6325842697),
 (1.5, 558980.6429319371),
 (2.0, 648891.163329693),
 (2.5, 1060346.4906832299),
 (3.0, 582526.0391517129),
 (3.5, 933312.5)]

5. Identify the houses with the highest prices:

In [20]:
# @title
%sql SELECT *\
FROM kc_TBL\
ORDER BY price DESC\
LIMIT 10;

 * sqlite:///kingcounty.db
Done.

[(7252, 6762700020, '20141013T000000', 7700000.0, 6.0, 8.0, 12050, 27600, 2.5, 0, 3, 4, 13, 8570, 3480, 1910, 1987, 98102, 47.6298, -122.323, 3940, 8800),
 (3914, 9808700762, '20140611T000000', 7062500.0, 5.0, 4.5, 10040, 37325, 2.0, 1, 2, 3, 11, 7680, 2360, 1940, 2001, 98004, 47.65, -122.214, 3930, 25449),
 (9254, 9208900037, '20140919T000000', 6885000.0, 6.0, 7.75, 9890, 31374, 2.0, 0, 4, 3, 13, 8860, 1030, 2001, 0, 98039, 47.6305, -122.24, 4540, 42730),
 (4411, 2470100110, '20140804T000000', 5570000.0, 5.0, 5.75, 9200, 35069, 2.0, 0, 0, 3, 13, 6200, 3000, 2001, 0, 98039, 47.6289, -122.233, 3560, 24345),
 (1448, 8907500070, '20150413T000000', 5350000.0, 5.0, 5.0, 8000, 23985, 2.0, 0, 4, 3, 12, 6720, 1280, 2009, 0, 98004, 47.6232, -122.22, 4600, 21750),
 (1315, 7558700030, '20150413T000000', 5300000.0, 6.0, 6.0, 7390, 24829, 2.0, 1, 4, 4, 12, 5000, 2390, 1991, 0, 98040, 47.5631, -122.21, 4320, 24619),
 (1164, 1247600105, '20141020T000000', 5110800.0, 5.0, 5.25, 8010, 45517, 2.0, 1, 4, 3, 12, 5990, 2020, 1999, 0, 98033, 47.6767, -122.211, 3430, 26788),
 (8092, 1924059029, '20140617T000000', 4668000.0, 5.0, 6.75, 9640, 13068, 1.0, 1, 4, 3, 12, 4820, 4820, 1983, 2009, 98040, 47.557, -122.21, 3270, 10454),
 (2626, 7738500731, '20140815T000000', 4500000.0, 5.0, 5.5, 6640, 40014, 2.0, 1, 4, 3, 12, 6350, 290, 2004, 0, 98155, 47.7493, -122.28, 3030, 23408),
 (8638, 3835500195, '20140618T000000', 4489000.0, 4.0, 3.0, 6430, 27517, 2.0, 0, 0, 3, 12, 6430, 0, 2001, 0, 98004, 47.6208, -122.219, 3720, 14592)]

6. Check the distribution of houses with and without a waterfront view:

In [26]:
# @title
%sql SELECT waterfront, COUNT(waterfront) AS count\
FROM kc_TBL\
GROUP BY waterfront;

 * sqlite:///kingcounty.db
Done.

[(0, 21450), (1, 163)]

In [ ]:
# @title